123456***********************************************************************
123456      01 RECORD.
123456       02 RECORD-TYPE-1.
123456           03  FIELD-1            PIC XA(16).
123456       02 RECORD-TYPE-2 REDEFINES RECORD-TYPE-1.
123456           03  FIELD-2            PIC X9(16).
123456       02 RECORD-TYPE-3 REDEFINES RECORD-TYPE-1.
123456           03  FIELD-3            PIC X(16).
123456***********************************************************************
